{
    "data": [
        {
            "id" : "1",
            "name" : "Harry Potter and the Philosopher's Stone",
            "desc" : "The 2001 fantasy film directed by Chris Columbus and distributed by Warner Bros. Pictures, based on J. K. Rowling's 1997 novel of the same name.",
            "rate" : 0
        },
        {
            "id" : "2",
            "name" : "Harry Potter and the Chamber's of Secret",
            "desc" : "The 2002 fantasy film directed by Chris Columbus and distributed by Warner Bros. Pictures, based on J. K. Rowling's 1998 novel of the same name. Produced by David Heyman and written by Steve Kloves, it is the sequel to Harry Potter and the Philosopher's Stone (2001) and the second instalment in the Harry Potter film series.",
            "rate" : 0
        },
        {
            "id" : "3",
            "name" : "Harry Potter and the Prisoner of Azkaban",
            "desc" : "The 2004 fantasy film directed by Alfonso Cuarón and distributed by Warner Bros. Pictures, based on J. K. Rowling's 1999 novel of the same name. Produced by Chris Columbus, David Heyman, and Mark Radcliffe and written by Steve Kloves, it is the sequel to Harry Potter and the Chamber of Secrets (2002) and the third instalment in the Harry Potter film series",
            "rate" : 0
        },
        {
            "id" : "4",
            "name" : "The Lord of the Rings: The Fellowship of the Ring",
            "desc" : "The 2001 epic fantasy adventure film directed by Peter Jackson, based on the 1954 novel The Fellowship of the Ring, the first volume of J. R. R. Tolkien's The Lord of the Rings. The film is the first installment in the Lord of the Rings trilogy. It was produced by Barrie M. Osborne, Jackson, Fran Walsh and Tim Sanders, and written by Walsh, Philippa Boyens and Jackson.",
            "rate" : 0
        },
        {
            "id" : "5",
            "name" : "The Lord of the Rings: The Two Towers",
            "desc" : "The 2002 epic fantasy adventure film directed by Peter Jackson, based on the second volume of J. R. R. Tolkien's The Lord of the Rings. The film is the second instalment in the Lord of the Rings trilogy and was produced by Barrie M. Osborne, Fran Walsh and Jackson, from a screenplay by Walsh, Philippa Boyens, Stephen Sinclair and Jackson.",
            "rate" : 0
        },
        {
            "id" : "6",
            "name" : "The Lord of the Rings: The Return of the King",
            "desc" : "The 2003 epic fantasy adventure film directed by Peter Jackson, based on the third volume of J. R. R. Tolkien's The Lord of the Rings. The film is the final entry in the Lord of the Rings trilogy and was produced by Barrie M. Osborne, Jackson and Fran Walsh, from a screenplay by Walsh, Philippa Boyens and Jackson.",
            "rate" : 0
        },
        {
            "id" : "7",
            "name" : "Iron Man",
            "desc" : "The 2008 American superhero film based on the Marvel Comics character of the same name. Produced by Marvel Studios and distributed by Paramount Pictures, it is the first film in the Marvel Cinematic Universe (MCU). Directed by Jon Favreau from a screenplay by the writing teams of Mark Fergus and Hawk Ostby, and Art Marcum and Matt Holloway, the film stars Robert Downey Jr. as Tony Stark / Iron Man alongside Terrence Howard, Jeff Bridges, Shaun Toub, and Gwyneth Paltrow.",
            "rate" : 0
        },
        {
            "id" : "8",
            "name" : "Marvel's The Avengers",
            "desc" : "Marvel's The Avengers (classified under the name Marvel Avengers Assemble in the United Kingdom and Ireland), or simply The Avengers, is a 2012 American superhero film based on the Marvel Comics superhero team of the same name. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the sixth film in the Marvel Cinematic Universe (MCU). Written and directed by Joss Whedon, the film features an ensemble cast including Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, and Jeremy Renner as the Avengers, alongside Tom Hiddleston, Clark Gregg, Cobie Smulders, Stellan Skarsgård, and Samuel L. Jackson.",
            "rate" : 0
        },
        {
            "id" : "9",
            "name" : "Avengers: Infinity War",
            "desc" : "The 2018 American superhero film based on the Marvel Comics superhero team the Avengers. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the sequel to The Avengers (2012) and Avengers: Age of Ultron (2015), and the 19th film in the Marvel Cinematic Universe (MCU). Directed by Anthony and Joe Russo and written by Christopher Markus and Stephen McFeely, the film features an ensemble cast including Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Benedict Cumberbatch, Don Cheadle, Tom Holland, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Anthony Mackie, Sebastian Stan, Danai Gurira, Letitia Wright, Dave Bautista, Zoe Saldaña, Josh Brolin, and Chris Pratt.",
            "rate" : 0
        },
        {
            "id" : "10",
            "name" : "Spider-Man (2002 film)",
            "desc" : "The 2002 American superhero film based on the Marvel Comics character of the same name. Directed by Sam Raimi from a screenplay by David Koepp, it is the first installment in the Spider-Man trilogy, and stars Tobey Maguire as the titular character, alongside Willem Dafoe, Kirsten Dunst, James Franco, Cliff Robertson, and Rosemary Harris.",
            "rate" : 0
        }
    ]
}